<?php
/* This file is part of BBClone (The PHP web counter on steroids)
 *
 * $Header: /cvs/bbclone/language/mk.php,v 1.4 2009/06/21 07:33:09 joku Exp $
 *
 * Copyright (C) 2001-2009, the BBClone Team (see file doc/authors.txt
 * distributed with this library)
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * See doc/copying.txt for details
 *
 * Prevod: Georgi Stanojevski <glisha@gmail.com>
 */

// The main array ($_ is for doing short in its call)
$_ = array(
// Specific charset
"global_charset" => "windows-1251",

// Date format (used with date())
"global_date_format" => "d.m.Y",

// Global translation
"global_bbclone_copyright" => "ББКлон тимот - Лиценцирано под ",
"global_last_reset" => "Последно ресетирање на статистиката ",
"global_yes" => "да",
"global_no" => "не",

// The error messages
"error_cannot_see_config" =>
"Не ви е дозволено да ја гледате конфигурација на овој сервер.",

// Address Extensions
"ac" => "Аксенсион остров",
"ad" => "Андора",
"ae" => "Обединети Арапски Емирати",
"aero" => "Аеро",
"af" => "Авганистан",
"ag" => "Антика и Барбуда",
"ai" => "Ангулија",
"al" => "Албанија",
"am" => "Ерменија",
"an" => "Холандски антили",
"ao" => "Ангола",
"aq" => "Антартика",
"ar" => "Аргентина",
"arpa" => "Арпа",
"as" => "Американска Самоа",
"at" => "Аустриа",
"au" => "Австралија",
"aw" => "Аруба",
"az" => "Азејрбејџан",
"ba" => "Босна и Херцеговина",
"bb" => "Барбадос",
"bd" => "Бангладеш",
"be" => "Белгија",
"bf" => "Буркина Фасо",
"bg" => "Бугарија",
"bh" => "Бехреин",
"bi" => "Бурунди",
"biz" => "Бизнис",
"bj" => "Бенин",
"bm" => "Бермуди",
"bn" => "Бруени",
"bo" => "Боливија",
"br" => "Бразил",
"bs" => "Бахами",
"bt" => "Бутан",
"bv" => "Остров Бувет",
"bw" => "Боцвана",
"by" => "Белорусија",
"bz" => "Белизе",
"ca" => "Канада",
"cc" => "Кокосови острови",
"cd" => "Конго",
"cf" => "Централно африканска република",
"cg" => "Конго",
"ch" => "Швајцарија",
"ci" => "Брег на слонова коска",
"ck" => "Кукови острови",
"cl" => "Чиле",
"cm" => "Камерун",
"cn" => "Кина",
"co" => "Колумбија",
"com" => "Комерцијално",
"coop" => "Кооп",
"cr" => "Костарика",
"cs" => "Србија и Црнагора",
"cu" => "Куба",
"cv" => "`Рт Верде",
"cx" => "Божиќни острови",
"cy" => "Кипар",
"cz" => "Чешка република",
"de" => "Германија",
"dj" => "Џубоути",
"dk" => "Данска",
"dm" => "Доминика",
"do" => "Доминиканска република",
"dz" => "Алжир",
"ec" => "Еквадор",
"edu" => "Образовно",
"ee" => "Естонија",
"eg" => "Египет",
"eh" => "Западна Сахара",
"er" => "Еритреа",
"es" => "Шпанија",
"et" => "Етиопија",
"eu" => "Европска унија",
"fi" => "Финска",
"fj" => "Фиџи",
"fk" => "Фокландски острови",
"fm" => "Микронезија",
"fo" => "Фарски острови",
"fr" => "Франција",
"ga" => "Габон",
"gb" => "Велика Британија",
"gd" => "Гренада",
"ge" => "Грузија",
"gf" => "Француска Гвајана",
"gg" => "Гуернси",
"gh" => "Гана",
"gi" => "Гибралтар",
"gl" => "Гренланд",
"gm" => "Гамбиа",
"gn" => "Гвинеја",
"gov" => "Влада на САД",
"gp" => "Гваделопе",
"gq" => "Екваторкска Гвинеја",
"gr" => "Грција",
"gs" => "Јужно Грузиски и Јужно Сендвич острови",
"gt" => "Гватемала",
"gu" => "Гуам",
"gw" => "Гвинеја-Бисау",
"gy" => "Гвајана",
"hk" => "Хонг Конг",
"hm" => "Херд и Мекдоналд острови",
"hn" => "Хондурас",
"hr" => "Хрватска",
"ht" => "Хаити",
"hu" => "Унгарија",
"id" => "Индонезија",
"ie" => "Ирска",
"il" => "Израел",
"im" => "Остров Ман",
"in" => "Индија",
"info" => "Информација",
"int" => "Интернационални организиции",
"io" => "Британски територии во Индиски Океан",
"iq" => "Ирак",
"ir" => "Иран",
"is" => "Исланд",
"it" => "Италија",
"je" => "Џерси",
"jm" => "Јамајка",
"jo" => "Јордан",
"jp" => "Јапонија",
"ke" => "Кенија",
"kg" => "Киргистан",
"kh" => "Камбоџа",
"ki" => "Кирибати",
"km" => "Коморос",
"kn" => "Св. Китс и Невис",
"kp" => "Северна Кореја",
"kr" => "Кореја",
"kw" => "Кувајт",
"ky" => "Кајмански острови",
"kz" => "Казакстан",
"la" => "Лаос",
"lb" => "Либан",
"lc" => "Св. Луција",
"li" => "Линхештајн",
"lk" => "Шри Ланка",
"lr" => "Либерија",
"ls" => "Лезото",
"lt" => "Литванија",
"lu" => "Луксембург",
"lv" => "Летонија",
"ly" => "Либија",
"ma" => "Мороко",
"mc" => "Монако",
"md" => "Молдавија",
"mg" => "Мадагаскар",
"mh" => "Маршалски острови",
"mil" => "Војска на САД",
"mk" => "Македонија",
"ml" => "Мали",
"mm" => "Мианмар",
"mn" => "Монголија",
"mo" => "Макао",
"mp" => "Северни Мариана острови",
"mq" => "Мартиник",
"mr" => "Мавританија",
"ms" => "Монтсерат",
"mt" => "Малта",
"museum" => "Музеј",
"mu" => "Маурициус",
"mv" => "Малдиви",
"mw" => "Малави",
"mx" => "Мексико",
"my" => "Малезија",
"mz" => "Мозамбик",
"na" => "Намибија",
"name" => "Лични",
"nc" => "Нова Каледонија",
"ne" => "Нигер",
"net" => "Мрежи",
"nf" => "Норфолк остров",
"ng" => "Нигерија",
"ni" => "Никарагва",
"nl" => "Холандија",
"no" => "Норвешка",
"np" => "Непал",
"nr" => "Науру",
"nu" => "Ниуе",
"numeric" => "Бројни",
"nz" => "Нов Зеланд",
"om" => "Оман",
"org" => "Организации",
"pa" => "Панама",
"pe" => "Перу",
"pf" => "Француска Полинезија",
"pg" => "Папуа Нова Гвинеја",
"ph" => "Филипини",
"pk" => "Пакистан",
"pl" => "Полска",
"pm" => "Св. Пјер и Мигелон",
"pn" => "Питкаирин",
"pr" => "Пуеро Рико",
"pro" => "Професионални",
"ps" => "Палестина",
"pt" => "Португалија",
"pw" => "Палау",
"py" => "Парагвај",
"qa" => "Катар",
"re" => "Реунион",
"ro" => "Романија",
"ru" => "Русија",
"rw" => "Руанда",
"sa" => "Саудиска Арабија",
"sb" => "Соломонски острови",
"sc" => "Сејшели",
"sd" => "Судан",
"se" => "Шведска",
"sg" => "Сингапур",
"sh" => "Св. Елена",
"si" => "Словенија",
"sj" => "Свалбард и Жан Мајен острови",
"sk" => "Словакиа",
"sl" => "Сиера Леоне",
"sm" => "Сан Марино",
"sn" => "Сенегал",
"so" => "Сомалија",
"sr" => "Суринам",
"st" => "Сао Томе и Принципе",
"su" => "Советски сојуз",
"sv" => "Ел Салвадор",
"sy" => "Сирија",
"sz" => "Свациленд",
"tc" => "Турски и Каикос острови",
"td" => "Чад",
"tf" => "Јужни француски територии",
"tg" => "Того",
"th" => "Тајланд",
"tj" => "Таџикистан",
"tk" => "Токелау",
"tl" => "Источен Тимор",
"tm" => "Туркменистан",
"tn" => "Тунис",
"to" => "Тонго",
"tp" => "Источен Тимор",
"tr" => "Турција",
"tt" => "Тринидад и Тобаго",
"tv" => "Тувалу",
"tw" => "Тајван",
"tz" => "Танзанија",
"ua" => "Украина",
"ug" => "Уганда",
"uk" => "Велика Британија",
"um" => "Мали острови на САД",
"unknown" => "Непознато",
"us" => "САД",
"uy" => "Уругвај",
"uz" => "Узбегистан",
"va" => "Ватикан",
"vc" => "Св. Винсент и Гранадините",
"ve" => "Венецуела",
"vg" => "Британски девствени острови",
"vi" => "Амеркиански девствени острови",
"vn" => "Виетнам",
"vu" => "Вануату",
"wf" => "Острови Валис и Футуна",
"ws" => "Самоа",
"ye" => "Јемен",
"yt" => "Мајоте",
"yu" => "Србија и Црнагора",
"za" => "Јужна Африка",
"zm" => "Замбија",
"zr" => "Заир",
"zw" => "Зимбабве",

// Miscellaneous translations
"misc_other" => "Друго",
"misc_unknown" => "Непознато",
"misc_second_unit" => "с",
"misc_ignored" => "Игнорирано",

// The Navigation Bar
"navbar_Main_Site" => "Главен сајт",
"navbar_Configuration" => "Конфигурација",
"navbar_Global_Stats" => "Глобална статистика",
"navbar_Detailed_Stats" => "Детална статистика",
"navbar_Time_Stats" => "Статистика по време",

// Detailed stats words
"dstat_id" => "ID",
"dstat_time" => "Време",
"dstat_visits" => "Посети",
"dstat_extension" => "Домен",
"dstat_dns" => "Име на домаќин",
"dstat_from" => "Од",
"dstat_os" => "ОС",
"dstat_browser" => "Прелистувач",
"dstat_visible_rows" => "Видливи пристапи",
"dstat_green_rows" => "зелени редови",
"dstat_blue_rows" => "сини редови",
"dstat_red_rows" => "црвени редови",
"dstat_search" => "Барај",
"dstat_last_page" => "Последна страница",
"dstat_last_visit" => "последна посета",
"dstat_robots" => "Роботи",
"dstat_no_data" => "Нема достапни податоци",
"dstat_prx" => "Меѓу сервер",
"dstat_ip" => "ИП адреса",
"dstat_user_agent" => "Прелистувач",
"dstat_nr" => "Бр.",
"dstat_pages" => "Страници",
"dstat_visit_length" => "Должина на посета",
"dstat_reloads" => "Освежувања",

// Global stats words
"gstat_Accesses" => "Пристапи",
"gstat_Total_visits" => "Вкупно посети",
"gstat_Total_unique" => "Вкупно уникатни",
"gstat_Operating_systems" => "Топ %d оперативни системи",
"gstat_Browsers" => "Топ %d прелистувачи",
"gstat_extensions" => "Топ %d домени",
"gstat_Robots" => "Топ %d Роботи",
"gstat_pages" => "Топ %d посетени страници",
"gstat_origins" => "Топ %d потекла",
"gstat_hosts" => "Топ %d домаќини",
"gstat_keys" => "Топ %d клучни зборови",
"gstat_Total" => "Вкупно",
"gstat_Not_specified" => "Неопределено",

// Time stats words
"tstat_Su" => "Нед",
"tstat_Mo" => "Пон",
"tstat_Tu" => "Вто",
"tstat_We" => "Сре",
"tstat_Th" => "Чет",
"tstat_Fr" => "Пет",
"tstat_Sa" => "Саб",

"tstat_Jan" => "Јан",
"tstat_Feb" => "Фев",
"tstat_Mar" => "Мар",
"tstat_Apr" => "Апр",
"tstat_May" => "Мај",
"tstat_Jun" => "Јун",
"tstat_Jul" => "Јул",
"tstat_Aug" => "Авг",
"tstat_Sep" => "Сеп",
"tstat_Oct" => "Окт",
"tstat_Nov" => "Ное",
"tstat_Dec" => "Дек",

"tstat_last_day" => "Изминат ден",
"tstat_last_week" => "Измината седмица",
"tstat_last_month" => "Изминат месец",
"tstat_last_year" => "Измината година",

// Configuration page words and sentences
"config_Variable_name" => "Име на променливата",
"config_Variable_value" => "Вредност на променливата",
"config_Explanations" => "Опис",

"config_bbc_mainsite" =>
"Ако е поставена, врска кон дадената локација ќе биде генериранa.
Вообичаената вредност е да се покажува кон главниот директориум. Во случај вашиот
главен сајт да е на друго место, единствено поставете ја вредноста соодветно.<br />
Примери: <br />
\$BBC_MAINSITE = &quot;http://www.myserver.com/&quot;<br />
\$BBC_MAINSITE = &quot;..&quot;<br />
\$BBC_MAINSITE = &quot;&quot;;",

"config_bbc_show_config" =>
"ББКлон вообичаено ги покажува поставките јавно. Во случај да не сакате тоа да
се случува може да го исклучите деактивирајќи ја оваа опција.<br />
Примери:
\$BBC_SHOW_CONFIG = 1;<br />
\$BBC_SHOW_CONFIG = &quot;&quot;;",

"config_bbc_titlebar" =>
"Насловот на страната за статистика.<br />
Тој ќе биде ист на сите страни за статистика.<br />
Следните променливи се дозволени:<br />
<ul>
<li>%SERVER: име на серверот,</li>
<li>%DATE: моменталната дата.</li>
</ul>
HTML тагови се дозволени.<br />
Примери:<br />
\$BBC_TITLEBAR = &quot;Статистика за %SERVER генерирано на %DATE&quot;;<br />
\$BBC_TITLEBAR = &quot;Мојата статистика за %DATE изгледаат вака:&quot;;
<br />",

"config_bbc_language" =>
"Вообичаениот јазик на ББКлон, во случај да не е специфициран од прелистувачот.
Подржани се следните јазици:
<p>ar, bg, bs, ca, cs, da, de, el, en, es, fi, fr, hu, id, it, ja, ko, lt, mk, nb, nl, pl, pt, pt-br, ro, ru,
sk, sl, sv, th, tr, ua, zh-cn and zh-tw</p>",

"config_bbc_maxtime" =>
"Оваа променлива ја дефинира должината на уникатните посети во секунди.
Секоја посета од истиот посетител во овој период ќе се смета како една посета. Вообичаената
вредност од 30 минути (1800сек) е дефакто стандард, но во зависност од вашите потреби
може да поставите друга вредност.<br />
Примери:
<br />
\$BBC_MAXTIME = 0;<br />
\$BBC_MAXTIME = 1800;",

"config_bbc_maxvisible" =>
"Колку ставки сакате да бидат излистани во деталната статистика? Вообичаената
вредност е 100. Препорачливо е да не го поставувате ова на повеќе од 500 за
да избегнете големи отперетувања на серверот.",

"config_bbc_detailed_stat_fields" =>
"Променливата \$BBC_DETAILED_STAT_FIELDS ги поставува колоните кои ќе бидат
прикажани во деталната статистика. Можни колони се:
<ul>
<li>id&nbsp;=&gt;&nbsp;Х-тиот посетител откога сте почнале да броите</li>
<li>time&nbsp;=&gt;&nbsp;Времето кога била забележана последната посета</li>
<li>visits&nbsp;=&gt;&nbsp;Посетите на поединечниот посетител</li>
<li>dns&nbsp;=&gt;&nbsp;Домаќинот на посетителот</li>
<li>ip&nbsp;=&gt;&nbsp;ИП адресата на посетителот</li>
<li>os&nbsp;=&gt;&nbsp;Оперативниот систем (ако е достапен)</li>
<li>browser&nbsp;=&gt;&nbsp;Прелистувачот
</li>
<li>ext&nbsp;=&gt;&nbsp;Државата или доменот на посетителот</li>
<li>referer&nbsp;=&gt;&nbsp;Страната од која што дошол посетителот (ако е достапна)
</li>
<li>page&nbsp;=&gt;&nbsp;Последната посетена страна</li>
<li>search&nbsp;=&gt;&nbsp;Клучниот збор при пребарување ако корисникот користел пребарувач</li>
</ul>
Истиот редослед по кој ќе ги наведете тука ќе се прикажуваат.<br />
Примери:<br />
\$BBC_DETAILED_STAT_FIELDS = &quot;id, time, visits, ip, ext, os, browser&quot;;
<br />
\$BBC_DETAILED_STAT_FIELDS = &quot;date, ext, browser, os, ip&quot;;<br />",

"config_bbc_time_offset" =>
"Во случај кога серверот не е во иста временска зона како и вас, можете да го
поставите времето во минути со оваа променлива. Негативни вредности ќе го вратат
времето назад, позитивни ќе го постават нанапред.<br />
Примери:<br />
\$BBC_TIME_OFFSET = 300;<br />
\$BBC_TIME_OFFSET = -300;<br />
\$BBC_TIME_OFFSET = 0;",

"config_bbc_no_dns" =>
"Оваа поставка дефинира дали ИП адресата треба да биде вратена во име на домаќин или не.
Иако името на домаќинот може да каже многу за вашиот посетител, сепак пронаѓањето може
значително да ви го успори вашиот сајт, ако ДНС серверите се спори, малку или на друг начин
недоверливи. Поставуањето на оваа променлива може да го реши проблемот.
<br />
Примери:<br />
\$BBC_NO_DNS = 1;<br />
\$BBC_NO_DNS = &quot;&quot;;",

"config_bbc_no_hits" =>
"Вообичаено за ББКлон е да ги прикажува сите посети во Временската статистика,
бидејќи тоа дава корисна информација за оптеретеноста на серверот. Сепак, ако сакате
во оваа статистика да се зимаат во предвид само уникатните посети поставете ја оваа
 променлива.<br />
Примери:<br />
\$BBC_NO_HITS = 1;<br />
\$BBC_NO_HITS = &quot;&quot;;",

"config_bbc_ignore_ip" =>
"Оваа променлива може да се користи за да не се зимаат во предвид определени
ИП адреси од статистиката. Ако сакате да додадете повеќе вредности одвоете ги
со запирка.<br />
Примери:<br />
\$BBC_IGNORE_IP = &quot;127., 192.168.&quot;;<br />
\$BBC_IGNORE_IP = &quot;&quot;;",

"config_bbc_ignore_refer" =>
"Во случај да не сакате некој кој го препорачал вашиот сајт да биде излистан во
деталната статистика, можете да наведете еден или повеќе клучни зборови кои ако
се совпаѓаат со некој препорачител нема да биде земен во предвид. Ако користите повеќе
клучни зборови, ве молам користете запирка за да ги одвоите.<br />
Примери:<br />
\$BBC_IGNORE_REFER = &quot;spambot.org, .escort.&quot;;<br />
\$BBC_IGNORE_REFER = &quot;&quot;;",

"config_bbc_ignore_bots" =>
"Може да ја користите оваа опција за како да се третираат роботите. Вообичаено е
да се игнорираат во Топ листите но да се остават во останатите статистики. Ако не
сакате воопшто да гледате роботи поставете ја вредноста на 2, тогаш само човечките посети
ќе се зимаат во предвид.<br />
Примери:<br />
\$BBC_IGNORE_BOTS = 2;<br />
\$BBC_IGNORE_BOTS = 1;<br />
\$BBC_IGNORE_BOTS = &quot;&quot;;",

"config_bbc_ignore_agent" =>
"Оваа опција дефинира како ББКлон ги распознава посетителите еден од друг. Вообичаено
е да се користи само ИП адресата, што дава реални бројки во повеќето случаи. Ако сепак
, вашите посетители често сурфаат позади некои помошни сервери, исклучувањето на оваа
опција може да даде пореални бројки, бидејќи нов посетител ќе се смета
кога и прелистувачот кој го користат ќе се смени.<br />
Примери:<br />
\$BBC_IGNORE_AGENT = 1;<br />
\$BBC_IGNORE_AGENT = &quot;&quot;;",

"config_bbc_kill_stats" =>
"Ако некогаш сакате да ги ресетирате статистиките вклучете ја оваа опција и
тие ќе се избришат при следната посета. Не заборавајте да ја деактивирате потоа, бидејќи
најверојатно ќе забележите невообичаено мал сообраќај. ;).<br />
Примери:<br />
\$BBC_KILL_STATS = 1;<br />
\$BBC_KILL_STATS = &quot;&quot;;",

"config_bbc_purge_single" =>
"Статистиките за домаќините и препорачувачите генерираат големи количини на податоци,
претежно генерирани од посетители кои доаѓаат еднаш. Вклчувајќи ја оваа
опција можете да ги избришете овие ставки и значително да го намалите access.php без
да се примети на вкупните видливи ставки за домаќините и препорачувачите. Овие посети
ќе видат броени како „Непознати“ ставки за да се зачува целокупниот резултат.<br />
Примери:<br />
\$BBC_PURGE_SINGLE = 1;<br />
\$BBC_PURGE_SINGLE = &quot;&quot;;"

);
?>
