<?php
/* This file is part of BBClone (The PHP web counter on steroids)
 *
 * $Header: /cvs/bbclone/language/ru.php,v 1.42 2009/06/21 07:33:09 joku Exp $
 *
 * Copyright (C) 2001-2009, the BBClone Team (see file doc/authors.txt
 * distributed with this library)
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * See doc/copying.txt for details
 *
 * Translated by: Alexey Rozenvaser alexroz@mailru.com,
 * Vladislav V. Korotkov cepesh@cepesh.ru, http://www.scientific-library.net
 * Updated by Lёppa lacontacts@ukrpost.net, http://www.leppsville.co.nr
 */

// The main array ($_ is for doing short in its call)
$_ = array(
// Specific charset
"global_charset" => "windows-1251",

// Date format (used with date() )
"global_date_format" => "d.m.Y",

// Global translation
"global_bbclone_copyright" => "Команда BBClone - Лицензия ",
"global_last_reset" => "Последний сброс статистики",
"global_yes" => "Да",
"global_no" => "Нет",

// The error messages
"error_cannot_see_config" =>
"Просмотр настроек BBClone недоступен.",

// Address Extensions
"ac" => "Остров Вознесения",
"ad" => "Андора",
"ae" => "Объединенные Арабские Эмираты",
"aero" => "Aero",
"af" => "Афганистан",
"ag" => "Антигуа и Барбуда",
"ai" => "Ангилла",
"al" => "Албания",
"am" => "Армения",
"an" => "Нидерланды",
"ao" => "Ангола",
"aq" => "Антарктида",
"ar" => "Аргентина",
"arpa" => "Ошибки",
"as" => "Американское Самоа",
"at" => "Австрия",
"au" => "Австралия",
"aw" => "Аруба",
"az" => "Азербайджан",
"ba" => "Босния и Герцеговина",
"bb" => "Барбадос",
"bd" => "Бангладеш",
"be" => "Бельгия",
"bf" => "Буркина Фасо",
"bg" => "Болгария",
"bh" => "Бахрейн",
"bi" => "Бурунди",
"biz" => "Коммерческие организации",
"bj" => "Бенин",
"bm" => "Бермуды",
"bn" => "Бруней",
"bo" => "Боливия",
"br" => "Бразилия",
"bs" => "Багамские Острова",
"bt" => "Бутан",
"bv" => "Острова Буве",
"bw" => "Ботсвана",
"by" => "Беларусь",
"bz" => "Белиз",
"ca" => "Канада",
"cc" => "Кокосовые Острова",
"cd" => "Конго",
"cf" => "Центрально-африканская республика",
"cg" => "Конго",
"ch" => "Швейцария",
"ci" => "Берег Слоновой Кости",
"ck" => "Острова Кука",
"cl" => "Чили",
"cm" => "Камерун",
"cn" => "Китай",
"co" => "Колумбия",
"com" => "Коммерческие",
"coop" => "Coop",
"cr" => "Коста Рика",
"cs" => "Serbia and Montenegro",
"cu" => "Куба",
"cv" => "Кабо Верде",
"cx" => "Остров Рождества",
"cy" => "Кипр",
"cz" => "Чешская республика",
"de" => "Германия",
"dj" => "Джибути",
"dk" => "Дания",
"dm" => "Доминика",
"do" => "Доминиканская Республика",
"dz" => "Алжир",
"ec" => "Эквадор",
"edu" => "Образовательные",
"ee" => "Эстония",
"eg" => "Египет",
"eh" => "Западная Сахара",
"er" => "Эритрея",
"es" => "Испания",
"et" => "Эфиопия",
"eu" => "Европейский союз",
"fi" => "Финляндия",
"fj" => "Фиджи",
"fk" => "Фолклендские Острова",
"fm" => "Микронезия",
"fo" => "Острова Фаро",
"fr" => "Франция",
"ga" => "Габон",
"gb" => "Великобритания",
"gd" => "Гренада",
"ge" => "Грузия",
"gf" => "Французская Гвиана",
"gg" => "Гуэрнси",
"gh" => "Гана",
"gi" => "Гибралтар",
"gl" => "Гренландия",
"gm" => "Гамбия",
"gn" => "Гвинея",
"gov" => "Правительственные",
"gp" => "Гваделупа",
"gq" => "Экваториальная Гвинея",
"gr" => "Греция",
"gs" => "Южная Георгия и Южные Сандвичевы острова",
"gt" => "Гватемала",
"gu" => "Гуам",
"gw" => "Гвинея-Бисау",
"gy" => "Гайана",
"hk" => "Гонконг",
"hm" => "Острова Херда и МакДоналда",
"hn" => "Гондурас",
"hr" => "Хорватия",
"ht" => "Гаити",
"hu" => "Венгрия",
"id" => "Индонезия",
"ie" => "Ирландия",
"il" => "Израиль",
"im" => "Остров Мэн",
"in" => "Индия",
"info" => "Информационные",
"int" => "Международная Организация",
"io" => "Британская Индийская и Океанская Территория",
"iq" => "Ирак",
"ir" => "Иран",
"is" => "Исландия",
"it" => "Италия",
"je" => "Джерси",
"jm" => "Ямайка",
"jo" => "Иордания",
"jp" => "Япония",
"ke" => "Кения",
"kg" => "Киргизстан",
"kh" => "Камбоджа",
"ki" => "Кирибати",
"km" => "Коморские Острова",
"kn" => "Сент-Китс и Невис",
"kp" => "Северная Корея",
"kr" => "Корея",
"kw" => "Кувейт",
"ky" => "Каймановы Острова",
"kz" => "Казахстан",
"la" => "Лаос",
"lb" => "Ливан",
"lc" => "Санта Люсия",
"li" => "Лихтенштейн",
"lk" => "Шри Ланка",
"lr" => "Либерия",
"ls" => "Лесото",
"lt" => "Литва",
"lu" => "Люксембург",
"lv" => "Латвия",
"ly" => "Ливия",
"ma" => "Марокко",
"mc" => "Монако",
"md" => "Молдова",
"mg" => "Мадагаскар",
"mh" => "Маршалловы Острова",
"mil" => "Армия США",
"mk" => "Македония",
"ml" => "Мали",
"mm" => "Мьянмар",
"mn" => "Монголия",
"mo" => "Макау",
"mp" => "Северные Марианские острова",
"mq" => "Мартиника",
"mr" => "Мавритания",
"ms" => "Монсеррат",
"mt" => "Мальта",
"mu" => "Маврикий",
"museum" => "Museum",
"mv" => "Мальдивы",
"mw" => "Малави",
"mx" => "Мексика",
"my" => "Малайзия",
"mz" => "Мозамбик",
"na" => "Намибия",
"name" => "Персональный",
"nc" => "Новая Каледония",
"ne" => "Нигер",
"net" => "Networks",
"nf" => "Остров Норфолк",
"ng" => "Нигерия",
"ni" => "Никарагуа",
"nl" => "Нидерланды",
"no" => "Норвегия",
"np" => "Непал",
"nr" => "Науру",
"nu" => "Ниуэ",
"numeric" => "Числовой IP",
"nz" => "Новая Зеландия",
"om" => "Оман",
"org" => "Некоммерческие организации",
"pa" => "Панама",
"pe" => "Перу",
"pf" => "Французская Полинезия",
"pg" => "Папуа Новая Гвинея",
"ph" => "Филиппины",
"pk" => "Пакистан",
"pl" => "Польша",
"pm" => "Св. Пьер и Маквелон",
"pn" => "Питкейрн",
"pr" => "Пуэрто Рико",
"pro" => "Professional",
"ps" => "Палестина",
"pt" => "Португалия",
"pw" => "Палау",
"py" => "Парагвай",
"qa" => "Катар",
"re" => "Реюнион",
"ro" => "Румыния",
"ru" => "РФ",
"rw" => "Руанда",
"sa" => "Саудовская Аравия",
"sb" => "Соломоновы Острова",
"sc" => "Сейшельские Острова",
"sd" => "Судан",
"se" => "Швеция",
"sg" => "Сингапур",
"sh" => "Св. Елена",
"si" => "Словения",
"sj" => "Острова Свалбард и Джен Майен",
"sk" => "Словакия",
"sl" => "Сьерра Леоне",
"sm" => "Сан Марино",
"sn" => "Сенегал",
"so" => "Сомали",
"sr" => "Суринам",
"st" => "Сан Томе и Принсипи",
"su" => "Бывший СССР",
"sv" => "Сальвадор",
"sy" => "Сирия",
"sz" => "Свазиленд",
"tc" => "Острова Текс и Кайакос",
"td" => "Чад",
"tf" => "Южные Французские Территории",
"tg" => "Того",
"th" => "Таиланд",
"tj" => "Таджикистан",
"tk" => "Токелау",
"tl" => "Восточный Тимор",
"tm" => "Туркменистан",
"tn" => "Тунис",
"to" => "Тонга",
"tp" => "Восточный Тимор",
"tr" => "Турция",
"tt" => "Тринидад и Табаго",
"tv" => "Тувалу",
"tw" => "Тайвань",
"tz" => "Танзания",
"ua" => "Украина",
"ug" => "Уганда",
"uk" => "Англия",
"um" => "Малые Отдаленные острова",
"unknown" => "Неизвестная",
"us" => "США",
"uy" => "Уругвай",
"uz" => "Узбекистан",
"va" => "Ватикан",
"vc" => "Сент-Винсент и Гренадины",
"ve" => "Венесуэла",
"vg" => "Острова Вирджин (UK)",
"vi" => "Острова Вирджин (США)",
"vn" => "Вьетнам",
"vu" => "Вануату",
"wf" => "Острова Уоллис и Футуна",
"ws" => "Самоа",
"ye" => "Йемен",
"yt" => "Майот",
"yu" => "Serbia and Montenegro",
"za" => "ЮАР",
"zm" => "Замбия",
"zr" => "Заир",
"zw" => "Зимбабве",

// Miscellaneous translations
"misc_other" => "Другой",
"misc_unknown" => "Неизвестный",
"misc_second_unit" => "сек.",
"misc_ignored" => "Проигнорировано",

// The Navigation Bar
"navbar_Main_Site" => "Главный сайт",
"navbar_Configuration" => "Конфигурация",
"navbar_Global_Stats" => "Общая статистика",
"navbar_Detailed_Stats" => "Детальная статистика",
"navbar_Time_Stats" => "Статистика по времени",

// Detailed stats words
"dstat_id" => "ID",
"dstat_time" => "Время",
"dstat_visits" => "Посещения",
"dstat_extension" => "Страна",
"dstat_dns" => "Адрес посетителя",
"dstat_from" => "По ссылке",
"dstat_os" => "ОС",
"dstat_browser" => "Браузер",
"dstat_visible_rows" => "Последних посещений",
"dstat_green_rows" => "зеленые строки",
"dstat_blue_rows" => "синие строки",
"dstat_red_rows" => "красные строки",
"dstat_search" => "Поиск",
"dstat_last_page" => "Последняя страница",
"dstat_last_visit" => "последнее посещение",
"dstat_robots" => "роботы",
"dstat_no_data" => "Нет данных",
"dstat_prx" => "Прокси-сервер",
"dstat_ip" => "IP Адрес",
"dstat_user_agent" => "User Agent",
"dstat_nr" => "№",
"dstat_pages" => "Страницы",
"dstat_visit_length" => "Длительность посещения",
"dstat_reloads" => "Перезагрузок страницы",

// Global stats words
"gstat_Accesses" => "Посетители",
"gstat_Total_visits" => "Всего посетителей",
"gstat_Total_unique" => "Всего уникальных",
"gstat_Operating_systems" => "Рейтинг %d ОС",
"gstat_Browsers" => "Рейтинг %d Браузеров",
"gstat_extensions" => "Рейтинг %d Доменов первого уровня",
"gstat_Robots" => "Рейтинг %d Роботов",
"gstat_pages" => "Рейтинг %d Посещенных страниц",
"gstat_origins" => "Рейтинг %d Источников",
"gstat_hosts" => "Рейтинг %d Хостов",
"gstat_keys" => "Рейтинг %d Ключевых слов",
"gstat_Total" => "Всего",
"gstat_Not_specified" => "Не определено",

// Time stats words
"tstat_Su" => "Вс",
"tstat_Mo" => "Пн",
"tstat_Tu" => "Вт",
"tstat_We" => "Ср",
"tstat_Th" => "Чт",
"tstat_Fr" => "Пт",
"tstat_Sa" => "Сб",

"tstat_Jan" => "Янв",
"tstat_Feb" => "Фев",
"tstat_Mar" => "Мар",
"tstat_Apr" => "Апр",
"tstat_May" => "Май",
"tstat_Jun" => "Июн",
"tstat_Jul" => "Июл",
"tstat_Aug" => "Авг",
"tstat_Sep" => "Сен",
"tstat_Oct" => "Окт",
"tstat_Nov" => "Ноя",
"tstat_Dec" => "Дек",
"tstat_last_day" => "Сегодня",
"tstat_last_week" => "На этой неделе",
"tstat_last_month" => "В этом месяце",
"tstat_last_year" => "В этом году (помесячно)",

// Configuration page words and sentences
"config_Variable_name" => "Имя переменной",
"config_Variable_value" => "Значение переменной",
"config_Explanations" => "Пояснение",

"config_bbc_mainsite" =>
"Если эта переменная установлена, то будет создана ссылка на указанное место. Значение
по умолчанию указывает на родительскую директорию. Если Ваш сайт расположен где-то в другом месте,
Вы, вероятно, захотите изменить значение переменной на удовлетворяющее Вашим требованиям.
<br />
Примеры:<br />
\$BBC_MAINSITE = &quot;http://www.myserver.com/&quot;<br />
\$BBC_MAINSITE = &quot;..&quot;<br />
\$BBC_MAINSITE = &quot;&quot;;",

"config_bbc_show_config" =>
"По умолчанию BBClone показывает настройки сбора и отображения статистики.
В случае, если это поведение Вас не устраивает, Вы можете запретить просмотр настроек, деактивируя эту опцию.
<br />
Примеры:<br />
\$BBC_SHOW_CONFIG = 1;<br />
\$BBC_SHOW_CONFIG = &quot;&quot;;",

"config_bbc_titlebar" =>
"Заголовок, который будет отображаться в навигационной полосе всех
страниц BBClone.<br />
Общеприняты нижеперечисленные макросы:<br />
<ul>
<li>%SERVER:&nbsp; имя сервера,</li>
<li>%DATE: текущая дата.</li>
</ul>
Тэги HTML тоже доступны.<br />
Примеры:<br />
\$BBC_TITLEBAR = &quot;Statistics for %SERVER generated the %DATE&quot;;<br />
\$BBC_TITLEBAR = &quot;My stats from %DATE look like this:&quot;;
<br />",

"config_bbc_language" =>
"Язык BBClone по умолчанию в случае, если он не определен браузером автоматически.
Поддерживаются следующие языки:
<p>ar, bg, bs, ca, cs, da, de, el, en, es, fi, fr, hu, id, it, ja, ko, lt, mk, nb, nl, pl, pt, pt-br, ro, ru,
sk, sl, sv, th, tr, uk, zh-cn and zh-tw</p>",

"config_bbc_maxtime" =>
"Эта переменна определяет продолжительность каждого уникального посещения в
секундах. Каждый хит от одного и того же посетителя в течение этого периода
будет считаться за одно посещение до тех пор, пока пауза между двумя
последовательными хитами не превысит указанного значения. По умолчанию выставлен
стандарт de facto для web в 30 минут (1800 секунд), но, в зависимости от Ваших нужд,
Вы можете выставить другое значение.<br />
Примеры:<br />
\$BBC_MAXTIME = 0;<br />
\$BBC_MAXTIME = 1800;",

"config_bbc_maxvisible" =>
"Сколько значений Вы хотите видеть в детальной статистике? По умолчанию - 100.
Не рекомендуется выставлять это значение больше 500 во избежание излишней нагрузки.",

"config_bbc_detailed_stat_fields" =>
"Переменная \$BBC_DETAILED_STAT_FIELDS определяет, какие колонки должны отображаться
в детальной статистике. Возможны следующие варианты:
<ul>
<li>id&nbsp;=&gt;&nbsp;Посетитель № X с момента установки BBclone</li>
<li>time&nbsp;=&gt;&nbsp;Время регистрации последнего хита</li>
<li>visits&nbsp;=&gt;&nbsp;Хиты уникального посетителя</li>
<li>dns&nbsp;=&gt;&nbsp;Хост посетителя</li>
<li>ip&nbsp;=&gt;&nbsp;IP адрес посетителя</li>
<li>os&nbsp;=&gt;&nbsp;Операционная Система (если доступно, или название робота)</li>
<li>browser&nbsp;=&gt;&nbsp;Програмное обеспечение, использованное для установления соединения</li>
<li>ext&nbsp;=&gt;&nbsp;Страна посетителя или корневое доменное имя</li>
<li>referer&nbsp;=&gt;&nbsp;Ссылка, с которой пришел посетитель (если доступно)</li>
<li>page&nbsp;=&gt;&nbsp;Последняя посещенная страница</li>
<li>search&nbsp;=&gt;&nbsp;Поисковый запрос, который ипользовал посетитель (если доступно)</li>
</ul>
Столбцы будут отображаться в том порядке, в котором Вы укажете их названия.<br />
Примеры:<br />
\$BBC_DETAILED_STAT_FIELDS = &quot;id, time, visits, ip, ext, os, browser&quot;;
<br />
\$BBC_DETAILED_STAT_FIELDS = &quot;date, ext, browser, os, ip&quot;;<br />",

"config_bbc_time_offset" =>
"Если время сервера не совпадает с Вашим локальным временем, то с помощью этой опции Вы можете
установить нужное время. Отрицательные значения сдвинут время назад, положительные - вперед.<br />
Примеры:<br />
\$BBC_TIME_OFFSET = 300;<br />
\$BBC_TIME_OFFSET = -300;<br />
\$BBC_TIME_OFFSET = 0;",

"config_bbc_no_dns" =>
"Эта опция определяет, следует ли резолвить IP посетителей в хосты. И хотя
хосты говорят больше о посетителях, розолвинг может значительно замедлить
работу Вашего сайта, если используемый для резолвинга DNS сервер медленно
работает, ограничен в возможностях или ненадежен по другим причинам. Установка
значения для этой опции поможет решить проблему.<br />
Примеры:<br />
\$BBC_NO_DNS = 1;<br />
\$BBC_NO_DNS = &quot;&quot;;",

"config_bbc_no_hits" =>
"По умолчанию BBClone показывает хиты в статистике по времени, поскольку это дает полезное
представление о фактической загрузке сервера. Однако же, если Вы предпочтете считать
статистику по времени по уникальным посетителям, Вы можете изменить способ подсчета, установив
этоу переменную.<br />
Примеры:<br />
\$BBC_NO_HITS = 1;<br />
\$BBC_NO_HITS = &quot;&quot;;",

"config_bbc_ignore_ip" =>
"Эта опция может быть использована, чтобы отключить сбор статистики для конкретных IP адресов
или диапазонов адресов. Для разделения нескольких записей используйте запятые.<br />
Примеры:<br />
\$BBC_IGNORE_IP = &quot;127., 192.168.&quot;;<br />
\$BBC_IGNORE_IP = &quot;&quot;;",

"config_bbc_ignore_refer" =>
"В случае, если Вы не хотите, чтобы отдельные ссылающиеся страницы, с которых
пришлм Ваши посетители, были отображены в рейтинге или в детальной статистике,
Вы можете задать одно или несколько ключевых слов, по которым будет блокироваться
ссылающаяся страница. Если Вы хотите назначить несколько ключевых слов - разделяйте
их запятыми.<br />
Примеры:<br />
\$BBC_IGNORE_REFER = &quot;spambot.org, .escort.&quot;;<br />
\$BBC_IGNORE_REFER = &quot;&quot;;",

"config_bbc_ignore_bots" =>
"Вы можете использовать эту опцию чтобы определить обработку роботов. По умолчанию
роботы игнорируются в рейтинге хостов, но учитываются во всей остальной статистике. Если
Вы не хотите видеть роботов совсем, Вы можете установить в эту опцию &quot;2&quot;,
в этом случае будут учитыватся только визиты людей.<br />
Примеры:<br />
\$BBC_IGNORE_BOTS = 2;<br />
\$BBC_IGNORE_BOTS = 1;<br />
\$BBC_IGNORE_BOTS = &quot;&quot;;",

"config_bbc_ignore_agent" =>
"Эта опция определяет, как BBClone отличает одного посетителя от другого. По умолчанию используется IP
адрес. В большинстве случаев этого хватает для создания реалистичной картины. Однако, если зачастую
Ваши посетители скрываются за прокси-серверами, деактивация этой опции обеспечит лучшую картину, ибо
каждая смена user agent'а будет означать появление нового посетителя.<br />
Примеры:<br />
\$BBC_IGNORE_AGENT = 1;<br />
\$BBC_IGNORE_AGENT = &quot;&quot;;",

"config_bbc_kill_stats" =>
"В случае, если Вы вдруг захотите сбросить всю статистику, установите значение этой опции, и при
следующем посещении сайта вся статистика сбросится. Не забудьте потом деактивировать эту опцию, иначе
статистика собираться не будет. ;)<br />
Примеры:<br />
\$BBC_KILL_STATS = 1;<br />
\$BBC_KILL_STATS = &quot;&quot;;",

"config_bbc_purge_single" =>
"Статистика по хостам и ссылающимся страницам может генерировать большое количество данных, в большинстве случаев причиной тому
единовременные посетители. Устанавив эту опцию, Вы можете очистить эти записи и существенно сократить размер access.php без вреда
видимой стаистике по хостам и ссылкам. Число хитов будет добавлено к записям &quot;not_specified&quot;, чтобы не нарушить общий счет.<br />
Примеры:<br />
\$BBC_PURGE_SINGLE = 1;<br />
\$BBC_PURGE_SINGLE = &quot;&quot;;"

);
?>
